'''
2. Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько
в ней слов. Используйте для решения задачи функцию `count`
'''
s = 'тестовая строка для проверки 987654321'
i = ' '
i1 = int(s.count(i)) + 1
print(i1)

