'''
1. Написать функцию `arithmetic`, принимающую 3 аргумента: первые 2 - числа,
 третий - операция, которая должна быть произведена над ними. Если третий
 аргумент +, сложить их; если —, то вычесть; * — умножить; / — разделить
 (первое на второе).В остальных случаях вернуть строку "Неизвестная операция".
'''
def arithmetic(a, b, c):
    if c == '+':
        print(a, '+', b, '=', a + b)
    elif c == '-':
        print(a, '-', b, '=', a - b)
    elif c == '*':
        print(a, '*', b, '=', a * b)
    elif c == '/':
        print(a, '/', b, '=', a / b)
    else:
        print('Неизвестная операция')
a = int(input('a = '))
b = int(input('b = '))
c = input("Введите операцию: ")
arithmetic(a, b, c)