#!/usr/bin/python3
'''
 operators
 Дано трехзначное число. Найдите сумму его цифр.
'''
a = input("введите трехзначное число: ")
print(int(a[0]) + int(a[1]) + int(a[2]))
